In [1]:
import os, pandas as pd, numpy as np
os.chdir(r'D:\새 폴더\Programing\Academy\Python\day0826')

In [2]:
col1 = [1, 2, 3, 4]
col2 = [True, False, False, True]
col3 = [1.1, 2.2, 3.3, 4.4]
col4 = ['one', 'two', 'three', 'four']
index = ['r1','r2','r3','r4']
df = pd.DataFrame(index=index, data={"c1": col1, "c2": col2, "c3": col3, "c4": col4})
df

    c1     c2   c3     c4
r1   1   True  1.1    one
r2   2  False  2.2    two
r3   3  False  3.3  three
r4   4   True  4.4   four

In [3]:
# 데이터 정보 확인
df.info()
print('==================================================')
df.dtypes

<class 'pandas.core.frame.DataFrame'>
Index: 4 entries, r1 to r4
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   c1      4 non-null      int64
 1   c2      4 non-null      bool
 2   c3      4 non-null      float64
 3   c4      4 non-null      object
dtypes: bool(1), float64(1), int64(1), object(1)
memory usage: 132.0+ bytes
==================================================

c1      int64
c2       bool
c3    float64
c4     object
dtype: object

In [4]:
# 열의 데이터 타입 변환
# dict 형태로 {'컬럼명':'변경 dtype'}

df1=df.astype({'c1':'int32','c3':'int64'})
df1

    c1     c2  c3     c4
r1   1   True   1    one
r2   2  False   2    two
r3   3  False   3  three
r4   4   True   4   four

In [5]:
# dtype 변경 확인
df1.dtypes

c1     int32
c2      bool
c3     int64
c4    object
dtype: object

In [6]:
# 한번에 여러개의 데이터를 동일한 타입으로 변경
# astype(dtype='변경dtype')
# 변경 불가능한 값이 있을 경우, errors='ignore'를 작성, 변경 못하는 값은 그냥 pass
df2=df.astype(dtype='int64',errors='ignore')
df2

    c1  c2  c3     c4
r1   1   1   1    one
r2   2   0   2    two
r3   3   0   3  three
r4   4   1   4   four

In [7]:
df4= pd.DataFrame([[4,9,],[1,5],[8,9]], columns=['c1','c2'])
df4

   c1  c2
0   4   9
1   1   5
2   8   9

In [8]:
# 전체 데이터 프레임이나, 특정 열의 값들이 정의한 함수에 따라 일괄적으로 변경
# 값에 1을 더하는 함수
def add_one(x):
    return x+1

In [9]:
# apply(def)
# DF의 값에대해 def 함수를 적용
df4['c1']=df4['c1'].apply(add_one)
df4

   c1  c2
0   5   9
1   2   5
2   9   9

In [10]:
# 새로운 DF 생성
df5 = pd.DataFrame([[1,4,9],[3,1,5],[5,8,9]], columns=['c1', 'c2','c3'])
df5

   c1  c2  c3
0   1   4   9
1   3   1   5
2   5   8   9

In [11]:
#모든 값에 대해 제곱근 처리
# np.sqrt : 제곱근 함수
df5.apply(np.sqrt)

         c1        c2        c3
0  1.000000  2.000000  3.000000
1  1.732051  1.000000  2.236068
2  2.236068  2.828427  3.000000